<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"292954535e2a73e6f19fc787a1ce8054a188903592400d6d8e8df8c8579f785b","plan_job_ref":"Job Create Terraform plan (DEV) #40 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14969009558","plan_out_hash":"6c7b4de30fd545c2897de24bdd9cba29ff16d65d4cb2230905dbc6e6ac6956f5","plan_hash":"61e48314261cfda48cb34d80b588e0d9802c04d127498a10c226a9fc837cc51a","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be created
+   resource "azurerm_kubernetes_cluster" "aks" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "openmrs-dev-audioprothese-dns-aks"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "francecentral"
+       name                                = "openmrs-dev-audioprothese-aks"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "openmrs"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Environment"  = "dev"
+           "organization" = "audioprothese"
+           "project"      = "openmrs"
        }
+       workload_identity_enabled           = false

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 2
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       web_app_routing {
+           dns_zone_ids             = []
+           web_app_routing_identity = (known after apply)
        }

+       windows_profile (known after apply)
    }

  # azurerm_resource_group.aks will be created
+   resource "azurerm_resource_group" "aks" {
+       id       = (known after apply)
+       location = "francecentral"
+       name     = "openmrs"
    }

  # helm_release.grafana will be created
+   resource "helm_release" "grafana" {
+       atomic                     = false
+       chart                      = "grafana"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "grafana"
+       namespace                  = "monitoring"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://grafana.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                ingress:
                  enabled: true
                  annotations: {}
                  labels: {}
                  path: /
                  pathType: Prefix
                  hosts:
                    - grafana.audioprothese.duckdns.org
                  extraPaths: []
                  tls: []
                  ingressClassName: "webapprouting.kubernetes.azure.com"
            EOT,
        ]
+       verify                     = false
+       version                    = "9.0.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.openmrs will be created
+   resource "helm_release" "openmrs" {
+       atomic                     = false
+       chart                      = "openmrs"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "openmrs"
+       namespace                  = "openmrs"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "oci://registry-1.docker.io/openmrs"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                # Global settings
                global:
                  defaultStorageClass: "default"
                
                # OpenMRS Backend settings
                openmrs-backend:
                  image:
                    tag: "qa"
                
                # OpenMRS Frontend settings
                openmrs-frontend:
                  image:
                    tag: "qa"
                
                # OpenMRS Gateway settings
                openmrs-gateway:
                  image:
                    tag: "qa"
                
                  service:
                    type: ClusterIP
                    port: 80
                
                  ingress:
                    enabled: true
                    className: "webapprouting.kubernetes.azure.com"
                    annotations: {}
                    rules:
                      - http:
                          paths:
                            - path: /
                              pathType: Prefix
                    tls: []
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.5"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.prometheus will be created
+   resource "helm_release" "prometheus" {
+       atomic                     = false
+       chart                      = "prometheus"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "prometheus"
+       namespace                  = "monitoring"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://prometheus-community.github.io/helm-charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                server:
                  ingress:
                    enabled: true
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                    annotations: {}
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
                      - prometheus.audioprothese.duckdns.org
                  extraPaths: []
                  tls: []
            EOT,
        ]
+       verify                     = false
+       version                    = "27.13.0"
+       wait                       = true
+       wait_for_jobs              = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #40](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/14969009558)